src/InformationRegisters/Scan_ПраваИНастройки/Scan_ПраваИНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПраваИНастройки</name>
  <comment>Хранит права доступа и настройки окружения пользователей</comment>
  <resources>
    <name>Значение</name>
    <comment>Значение права / настройки</comment>
    <type>
      <types>Characteristic.Scan_ПраваИНастройки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравоНастройка</name>
    <comment>Право или настройка, по которой хранится значение</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДоступКСправочникам/Scan_ДоступКСправочникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДоступКСправочникам</name>
  <comment>Доступ к справочникам (scania)</comment>
  <resources>
    <name>ДоступЕсть</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДоступКДокументам/Scan_ДоступКДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДоступКДокументам</name>
  <comment>Доступ к документам (scania)</comment>
  <resources>
    <name>ДоступЕсть</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Scan_ПраваИНастройки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, на уровне которого производится настройка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ВидыПравДляСправочников/Scan_ВидыПравДляСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыПравДляСправочников</name>
  <enumValues>
    <name>Редактирование</name>
  </enumValues>
  <enumValues>
    <name>РедактированиеПоГруппам</name>
  </enumValues>
  <enumValues>
    <name>Чтение</name>
  </enumValues>
  <enumValues>
    <name>НетДоступа</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ВидыПравДляДокументов/Scan_ВидыПравДляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыПравДляДокументов</name>
  <enumValues>
    <name>РедактированиеВсе</name>
  </enumValues>
  <enumValues>
    <name>РедактированиеПоПользователям</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеВсе</name>
  </enumValues>
  <enumValues>
    <name>НетДоступа</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCharacteristicTypes/Scan_ПраваИНастройки/Scan_ПраваИНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Scan_ПраваИНастройки</name>
  <comment>Классификатор прав и настроек конфигурации</comment>
  <type>
    <types>CatalogRef.Scan_ШаблоныПисем</types>
    <types>CatalogRef.Scan_ВидыПродуктов</types>
    <types>CatalogRef.Scan_ТипыПродуктов</types>
    <types>CatalogRef.Scan_ТребованияОформленияКПОтКузовостроителя</types>
    <types>CatalogRef.Scan_ШаблоныСогласования</types>
    <types>CatalogRef.Scan_Сотрудники</types>
    <types>CatalogRef.Валюты</types>
    <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    <types>Boolean</types>
    <types>CatalogRef.Scan_ГруппыПродуктов</types>
    <types>EnumRef.Scan_ВариантыСортировкиХО</types>
    <types>CatalogRef.Scan_Контрагенты</types>
    <types>String</types>
    <types>CatalogRef.Scan_ВидыВзаимодействий</types>
    <types>CatalogRef.Scan_ШаблоныУсловийОплаты</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Scan_СтатусыЭПТС</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.Scan_МестаХранения</types>
    <types>CatalogRef.Scan_КодыАдресовДоставки</types>
    <types>CatalogRef.Scan_Подразделения</types>
    <types>CatalogRef.Scan_ГруппыПользователейДляСогласования</types>
    <types>CatalogRef.ВидыКонтактнойИнформации</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документы</name>
      <description>ДОКУМЕНТЫ</description>
      <code>40000</code>
        </content>
        </content>
        </content>
        </content>
      </content>
      </content>
    </items>
    <items>
      <name>НастройкиАРМ</name>
      <description>НАСТРОЙКИ &quot;АРМ&quot;</description>
      <code>20000</code>
      </content>
    </items>
    <items>
      <name>НастройкиОтображенияИнформации</name>
      <description>Настройки отображения информации</description>
      <code>80000</code>
    </items>
    <items>
      <name>НастройкиОтправкиНапоминанийИПисем</name>
      <description>НАСТРОЙКИ ОТПРАВКИ НАПОМИНАНИЙ И ПИСЕМ</description>
      <code>70000</code>
      </content>
        </content>
        </content>
      </content>
    </items>
    <items>
      <name>ОбщиеПраваДоступа</name>
      <description>ОБЩИЕ ПРАВА ДОСТУПА</description>
      <code>10000</code>
    </items>
    <items>
      <name>Отчеты</name>
      <description>ОТЧЕТЫ</description>
      <code>50000</code>
    </items>
    <items>
      <name>ПараметрыСистемы</name>
      <description>ПАРАМЕТРЫ СИСТЕМЫ</description>
      <code>60000</code>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Справочники</name>
      <description>СПРАВОЧНИКИ</description>
      <code>30000</code>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Значение права / настройки по умолчанию</comment>
    <type>
      <types>Characteristic.Scan_ПраваИНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <comment>Признак доступности права / настройки для компании / организации / подразделения / пользователя</comment>
    <type>
      <types>EnumRef.Scan_НазначениеПравИНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОрганизации</name>
    <comment>Настройка организации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПользователя</name>
    <comment>Настройка пользователя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНастройка</name>
    <comment>Настройки могут изменяться пользователем, Права изменяются только администратором</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПодразделения</name>
    <comment>Настройка подразделения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/CommonModules/Scan_ПраваИНастройкиПовтИсп/Module.bsl
// Получает текущие значения прав и настроек из регистра ПраваИНастройки.
// Выбираются все права и настройки текущего пользователя, всех организаций и всех подразделений,
//права и настройки других пользователей не кэшируются в целях защиты информации
//
Функция ПолучитьЗначенияВсехПравНастроек(Знач ТекущийПользователь) Экспорт
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ЗапросПраваНастройки = Новый Запрос(
	"ВЫБРАТЬ
	|	ПланВидовХарактеристикПраваИНастройки.Ссылка,
	|	ПланВидовХарактеристикПраваИНастройки.ТипЗначения,
	|	ПланВидовХарактеристикПраваИНастройки.Назначение,
	|	ПланВидовХарактеристикПраваИНастройки.ЗначениеПоУмолчанию,
	//|	ПланВидовХарактеристикПраваИНастройки.НастройкаКомпании,
	|	ПланВидовХарактеристикПраваИНастройки.НастройкаОрганизации,
	|	ПланВидовХарактеристикПраваИНастройки.НастройкаПодразделения,
	|	ПланВидовХарактеристикПраваИНастройки.НастройкаПользователя
	|ИЗ
	|	ПланВидовХарактеристик.Scan_ПраваИНастройки КАК ПланВидовХарактеристикПраваИНастройки
	|ГДЕ
	|	(ПланВидовХарактеристикПраваИНастройки.Предопределенный
	|	ИЛИ ПланВидовХарактеристикПраваИНастройки.Родитель = &ГруппаПВХНастройкаДоступностиСправочники
	|	ИЛИ	ПланВидовХарактеристикПраваИНастройки.Родитель = &ГруппаПВХНастройкаДоступностиДокументы)
	|	И (НЕ ПланВидовХарактеристикПраваИНастройки.ЭтоГруппа)");
	ЗапросПраваНастройки.УстановитьПараметр("ГруппаПВХНастройкаДоступностиСправочники", Scan_ПраваИНастройки.Scan_ПолучитьСсылкуПВХПравИНастроек("СПРАВОЧНИКИ"));
	ЗапросПраваНастройки.УстановитьПараметр("ГруппаПВХНастройкаДоступностиДокументы", Scan_ПраваИНастройки.Scan_ПолучитьСсылкуПВХПравИНастроек("ДОКУМЕНТЫ"));
	ВыборкаПраваНастройки = ЗапросПраваНастройки.Выполнить().Выбрать();
	
	НЗЗначенияПравИНастроек = РегистрыСведений.Scan_ПраваИНастройки.СоздатьНаборЗаписей();
	НЗЗначенияПравИНастроек.Прочитать();
	тблЗначенияПравИНастроек = НЗЗначенияПравИНастроек.Выгрузить();
	
	СтруктураПравНастроек = Новый Соответствие;
	
	Пока ВыборкаПраваНастройки.Следующий() Цикл
		Если ВыборкаПраваНастройки.НастройкаПользователя Тогда
			СтрокиЗначенияПравИНастроек = тблЗначенияПравИНастроек.НайтиСтроки(Новый Структура("ПравоНастройка, Объект", ВыборкаПраваНастройки.Ссылка, ТекущийПользователь));
		Иначе
			СтрокиЗначенияПравИНастроек = тблЗначенияПравИНастроек.НайтиСтроки(Новый Структура("ПравоНастройка", ВыборкаПраваНастройки.Ссылка));
		КонецЕсли;
		
		СОбъектыПрава = Новый Соответствие;
		Для Каждого ТекСтрокаЗначение Из СтрокиЗначенияПравИНастроек Цикл
			СОбъектыПрава.Вставить(ТекСтрокаЗначение.Объект, ТекСтрокаЗначение.Значение);
		КонецЦикла;
		
		// добавляем значение по умолчанию
		ЗначениеПоУмолчанию = ВыборкаПраваНастройки.ЗначениеПоУмолчанию;
		// если и по умолчанию ничего нет, то типизируем (на всякий случай)
		Если НЕ ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда
			ЗначениеПоУмолчанию = ВыборкаПраваНастройки.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЕсли;
		СОбъектыПрава.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
		
		СтруктураПравНастроек.Вставить(ВыборкаПраваНастройки.Ссылка, СОбъектыПрава);
	КонецЦикла;
	
	// Запрос для кэширования дополнительных настроек доступа справочников и документов
	// из регистров сведений ДоступКСправочникам и ДоступКДокументам
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоступКСправочникам.Объект КАК Объект,
	|	ДоступКСправочникам.ДоступЕсть КАК ДоступЕсть,
	|	ДоступКСправочникам.Право КАК Право
	|ИЗ
	|	РегистрСведений.Scan_ПраваИНастройки КАК ПраваИНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ДоступКСправочникам КАК ДоступКСправочникам
	|		ПО ПраваИНастройки.Объект = ДоступКСправочникам.Пользователь
	|			И ПраваИНастройки.ПравоНастройка = ДоступКСправочникам.Право
	|ГДЕ
	|	ПраваИНастройки.Объект = &Пользователь
	|	И ПраваИНастройки.Значение = &ВыбЗначенияПравСправочников
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоступКДокументам.Объект,
	|	ДоступКДокументам.ДоступЕсть,
	|	ДоступКДокументам.Право
	|ИЗ
	|	РегистрСведений.Scan_ПраваИНастройки КАК ПраваИНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ДоступКДокументам КАК ДоступКДокументам
	|		ПО ПраваИНастройки.Объект = ДоступКДокументам.Пользователь
	|			И ПраваИНастройки.ПравоНастройка = ДоступКДокументам.Право
	|ГДЕ
	|	ПраваИНастройки.Объект = &Пользователь
	|	И ПраваИНастройки.Значение В(&ВыбЗначенияПравДокументов)
	|ИТОГИ
	|	МАКСИМУМ(ДоступЕсть)
	|ПО
	|	Право,
	|	Объект");
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ВыбЗначенияПравСправочников", Перечисления.Scan_ВидыПравДляСправочников.РедактированиеПоГруппам);
	масВидыПравДляДокументов = Новый Массив;
	масВидыПравДляДокументов.Добавить(Перечисления.Scan_ВидыПравДляДокументов.РедактированиеПоПользователям); 
	Запрос.УстановитьПараметр("ВыбЗначенияПравДокументов", масВидыПравДляДокументов);
	
	РезультатПраво = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Перебор полученных значений и формирование соответствия прав
	Пока РезультатПраво.Следующий() Цикл
		РезультатОбъект = РезультатПраво.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СОбъектыПрава = Новый Соответствие;
		Пока РезультатОбъект.Следующий() Цикл
			СОбъектыПрава.Вставить(РезультатОбъект.Объект, РезультатОбъект.ДоступЕсть);
		КонецЦикла;
		СтруктураПравНастроек.Вставить("Значения " + РезультатПраво.Право.Наименование, СОбъектыПрава);
	КонецЦикла;
	
	Возврат СтруктураПравНастроек;
КонецФункции
